# Tap's
brew "grype"
brew "mas"
tap "chainguard-dev/tap"

# Macos Tools
brew "diff-so-fancy"
brew "pstree"
brew "htop"
brew "ncdu"
brew "tree"
brew "wget"
brew "watch"
brew "tldr"
brew "telnet"
brew "jq"
brew "iproute2mac"
brew "neovim"
brew "gnupg"

# DevOps Tools
brew "kubernetes-cli"
brew "helm"
brew "kubectx"
brew "kustomize"
brew "go"
brew "krew"
brew "awscli"
brew "azure-cli"
brew "terraform"
cask "google-cloud-sdk"
cask "tailscale"
brew "nmap"
brew "operator-sdk"
brew "gh"
brew "aicommits"
brew "node"
brew "glow"
brew "k3d"
brew "k6"
brew "chainctl"
brew "fzf"

# Fun tools
brew "asciinema"
brew "lolcat"

# Desktop Software
cask "slack"
cask "spotify"
cask "discord"
cask "iterm2"
cask "visual-studio-code"
cask "rectangle"
cask "postman"
cask "jetbrains-toolbox"
cask "vlc"
cask "notion"
cask "orbstack"
cask "google-cloud-sdk"
cask "qbittorrent"
cask "google-chrome"
cask "alacritty"
